//1.面向对象介绍（基本和C语言一样）
//面向：拿，找
//对象：能干活的东西
//面向对象编程：拿对象过来做对应的事情（如scanner,random）
//2.类声明的变量就是对象
//3.如何定义类
//public class 类名{
//（1）成员变量（代表属性，一般是名词）
//（2）成员方法（代表行为，一般是动词）
//（3）构造器
//（4）代码块
//（5）内部类
// }
//4.（1）如何得到类的对象
//类名 对象名=new 类名（）；
//（2）如何使用对象
//访问属性：对象名.成员变量
//访问行为：对象名.方法名()

//5.用来描述一类事物的类，专业叫做：javabean类。在javabean类中，是不写main方法的
//在以前，编写main方法的类，叫做测试类。我们可以在测试类中创建javabean类的对象并进行赋值调用

//6.补充注意事项：
//（1）类的首字母建议大写
//（2）一个java文件可以定义多个class类，且只能由一个类是public修饰，而且public修饰的类必须成为代码文件名。
//实际开发中建议还是一个文件定义一个class类
//（3）成员变量的完整定义格式是：修饰符 数据类型 变量名称=初始化值。一般无需指定初始化值，存在默认值。
public class 面向对象_1 {
}

